app/controllers/actors_controller.rb

SELECT "actors".* FROM "actors"
---
  def index
    @actors = Actor.all

INSERT INTO "actors" ("name", "birthdate", "gender", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", ""], ["birthdate", 2017-01-27 22:39:00 UTC], ["gender", ""], ["created_at", 2017-01-27 22:39:12 UTC], ["updated_at", 2017-01-27 22:39:12 UTC]]
---
  def create
    @actor = Actor.new(actor_params)

    respond_to do |format|
      if @actor.save

SELECT  "actors".* FROM "actors" WHERE "actors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_actor
      @actor = Actor.find(params[:id])