app/controllers/movies_controller.rb

  def show
    id = params['id']
    @movie = Movie.find id
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @movie = Movie.new(movie_params)
    if @movie.save
---
INSERT INTO "movies" ("title", "description", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "two"], ["description", "aaaa"], ["release_date", 2017-01-26 00:00:00 UTC], ["created_at", 2017-01-26 23:10:12 UTC], ["updated_at", 2017-01-26 23:10:12 UTC]]

def edit
  id = params['id']
  @movie = Movie.find id
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

def update
  id = params['id']
  @movie = Movie.find(id)
  @movie.update(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "movies" SET "description" = ?, "release_date" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["description", "aaaaazzzz"], ["release_date", 1993-11-25 00:00:00 UTC], ["updated_at", 2017-01-27 21:15:48 UTC], ["id", 1]]